In [17]:
import numpy as np

import pandas as pd

In [18]:
from numpy.random import randn

In [19]:
np.random.seed(101)

In [20]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [23]:
booldf = df>0

In [24]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [28]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [31]:
 df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [32]:
df[ (df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df[ (df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [36]:
newind = 'CA, NY, WY, OR, CO'.split()

In [37]:
df['States'] = newind

In [38]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826    CA,
B  0.651118 -0.319318 -0.848077  0.605965    NY,
C -2.018168  0.740122  0.528813 -0.589001    WY,
D  0.188695 -0.758872 -0.933237  0.955057    OR,
E  0.190794  1.978757  2.605967  0.683509     CO

In [39]:
df.set_index('States')

               W         X         Y         Z
States
CA,     2.706850  0.628133  0.907969  0.503826
NY,     0.651118 -0.319318 -0.848077  0.605965
WY,    -2.018168  0.740122  0.528813 -0.589001
OR,     0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# PANDAS PRACTICE

In [46]:
import numpy as np
import pandas as pd

In [47]:
from numpy.random import randint

In [49]:
np.random.seed(101)

In [51]:
df1 = pd.DataFrame(randint(1,100,(5,4)),['A','B','C','D','E'],['W','X','Y','Z'])

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65
E   6  13  94  41

In [55]:
df1 < 50

       W      X      Y      Z
A  False   True  False  False
B  False  False  False   True
C  False   True   True  False
D   True  False  False  False
E   True   True  False   True

In [56]:
df1[df1 < 50]

      W     X    Y     Z
A   NaN  12.0  NaN   NaN
B   NaN   NaN  NaN  10.0
C   NaN  41.0  5.0   NaN
D  41.0   NaN  NaN   NaN
E   6.0  13.0  NaN  41.0

In [59]:
df1[df1 < 80]

      W     X     Y   Z
A   NaN  12.0   NaN  71
B  64.0   NaN  76.0  10
C  78.0  41.0   5.0  64
D  41.0  61.0   NaN  65
E   6.0  13.0   NaN  41

In [60]:
df1['W']>50

A     True
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [61]:
df1[df1['W']>50]

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64

In [62]:
df1

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65
E   6  13  94  41

In [63]:
df1[df1['X']>70]

    W   X   Y   Z
B  64  88  76  10

In [65]:
df1[df1['Z'] == 10]

    W   X   Y   Z
B  64  88  76  10

In [66]:
df1[df1['Y'] == 5]

    W   X  Y   Z
C  78  41  5  64

In [72]:
df1[(df1['W'] > 50) & (df1['Y'] < 60)]

    W   X  Y   Z
C  78  41  5  64

In [73]:
df1[(df1['W'] > 50) | (df1['Y'] < 60)]

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64

In [74]:
df1.reset_index()

  index   W   X   Y   Z
0     A  96  12  82  71
1     B  64  88  76  10
2     C  78  41   5  64
3     D  41  61  93  65
4     E   6  13  94  41

In [78]:
New = [21,22,23,24,25]

df1['New'] = New

In [79]:
df1

    W   X   Y   Z  New
A  96  12  82  71   21
B  64  88  76  10   22
C  78  41   5  64   23
D  41  61  93  65   24
E   6  13  94  41   25

In [82]:
df1.drop('New',axis = 1,inplace = True)

In [83]:
df1

    W   X   Y   Z
A  96  12  82  71
B  64  88  76  10
C  78  41   5  64
D  41  61  93  65
E   6  13  94  41

In [84]:
df1.loc['A']

W    96
X    12
Y    82
Z    71
Name: A, dtype: int32

In [85]:
df1.iloc[2]

W    78
X    41
Y     5
Z    64
Name: C, dtype: int32